<template>
  <div class="app-container">
    <div class="wrapper">
      <code>
        1、如果过了试用期，则在单位没有违法的情况下应当提前三十日以书面形式通知用人单位<br>
        2、如果是在试用期内提出辞职，则只要提前三天就可以了<br>
        3、法律依据：《劳动合同法》(2012修正)第三十七条　【劳动者提前通知解除劳动合同】劳动者提前三十日以书面形式通知用人单位，可以解除劳动合同。劳动者在试用期内提前三日通知用人单位，可以解除劳动合同<br>
        劳动者有下列情形之一的，用人单位可以解除劳动合同：<br>
(一)在试用期间被证明不符合录用条件的;<br>
(二)严重违反用人单位的规章制度的;<br>
(三)严重失职，营私舞弊，给用人单位造成重大损害的;<br>
(四)劳动者同时与其他用人单位建立劳动关系，对完成本单位的工作任务造成严重影响，或者经用人单位提出，拒不改正的;<br>
(五)因本法第二十六条第一款第一项规定的情形致使劳动合同无效的;<br>
(六)被依法追究刑事责任的。<br>
第四十七条 经济补偿按劳动者在本单位工作的年限，每满一年支付一个月工资的标准向劳动者支付。六个月以上不满一年的，按一年计算；不满六个月的，向劳动者支付半个月工资的经济补偿。<br>
第八十七条 用人单位违反本法规定解除或者终止劳动合同的，应当依照本法第四十七条规定的经济补偿标准的二倍向劳动者支付赔偿金。
      </code>
    </div>
  </div>
</template>

<style scoped>
.wrapper {
  width: 800px;
  margin: 30px auto;
  font-weight: lighter;
}
</style>
